public class HW2_Git {
    public static void main(String[] args) {

        /*
        Есть две переменные целого типа. Написать программу, выводящую на экран сумму их значений,
        а в том в случае, если эти числа равны, должна выводиться двойная сумма.
        Пример: 1 + 2 -> 3
        3 + 2 -> 5
        2 + 2 -> 8
         */

        int a = 3;
        int b = 5;

        System.out.println(a == 10 || b == 10 || a + b == 10);

        if (a == 10 || b == 10) {
            System.out.println("True");
        }

    }
}

